performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 3
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
  #processor: "./myProcessor.js"
scenarios:
  - flow:
      - get:
          url: "/rest/v1/tasks"
      - post:
          url: "/rest/v1/tasks"
          json:
           content: "Buy Milk"
          capture:
           json: "$.id"
           as: "id"
      - log: "id of new created task is {{ id }}"
      - get:
          url: "/rest/v1/tasks/{{ id }}"
          capture:
           json: "$.id"
           as: "id"
      - log: "Current id is {{ id }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
           content: "Buy Coffee"
      - post:
          url: "/rest/v1/tasks/{{ id }}/close"
      - post:
          url: "/rest/v1/tasks/{{ id }}/reopen"
      - delete:
          url: "/rest/v1/tasks/{{ id }}"
          
# For more information: https://artillery.io/docs/script-reference/